/*
	Обхождане на масив и изкарване на броя на четните числа,
	които са по-големи от 100 и по-малки от 10 000.


	Ако имате въпроси не се притеснявайте да питате. :)
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
  int array[10] = {101, 95, 12, 9883, 6060, 8080, 1666, 123, 1345, 10001};
  int count = 0;
  int i;

  for(i = 0; i < 10; i++) {
    if((array[i] > 100) && (array[i] < 10000)) {
      if((array[i] % 2) == 0) {
        count += 1;
      } 
    }
  }

  printf("%d", count);

  return 0;
}
