/*
	Дадени са два масива (A и B), с n на брой положителни целочиесни елементи, всеки един от тях.
	Да се прегледат всички двойки от елементи с еднакви индекси от двата масива, като по-големият
	от двата елемента да се записва в трети масив C. В случай, че сумата на елементите на масива
	C е трицифрено число, да се изведе последната ѝ цифра.


	Ако имате някакви въпроси не се притеснявайте да питате. :)
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
  int A[10] = {1, 12, 23, 45, 32, 64, 92, 86, 19, 58};
  int B[10] = {4, 11, 29, 48, 13, 99, 66, 13, 42, 55};
  int C[10];
  int i, temp;
  int sum = 0;

  for(i = 0; i < 10; i++) {
    if(A[i] >= B[i]) {
      C[i] = A[i];
    } else {
      C[i] = B[i];
    }

    sum += C[i];
  }

  temp = sum;

  for(i = 0; i < 2; i++) {
    temp = temp / 10;
  }

  if((temp < 10) && (temp > 0)) {
    printf("%d", sum % 10);
  }
  
  return 0;
}
